Railings are placed completely outside the host. It may change the adjustment of the railing to the host and its vertical position.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public static FailureDefinitionId RailPlacedOutsideOfHost { get; }
  Visual Basic
Public Shared ReadOnly Property RailPlacedOutsideOfHost As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ RailPlacedOutsideOfHost {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace